<template>
    <section class="chart-container">
<h2 align="center">quartz定时任务说明</h2>
<h4 align="center">允许出现的7个字段分别是秒、分、小时、日、月、周几、年（可选字段），除了年，前面6个为必选字段</h4>
<table align="center" >
<tr align="center">
<th style="width:300px">字段名</th><th style="width:300px">允许的值</th><th style="width:300px">允许的特殊值</th>
</tr>
<tr align="center">
<td>秒</td><td>0-59</td><td>, - * /</td>
</tr>
<tr align="center">
<td>分</td><td>0-59</td><td>, - * /</td>
</tr>
<tr align="center">
<td>小时</td><td>0-23</td><td>, - * /</td>
</tr>
<tr align="center">
<td>日</td><td>1-31</td><td>, - * ? / L W C</td>
</tr>
<tr align="center">
<td>月</td><td>1-12 or JAN-DEC</td><td>, - * /</td>
</tr>
<tr align="center">
<td>周几</td><td>1-7 or SUN-SAT</td><td>, - * ? / L C #</td>
</tr>
<tr align="center">
<td>年（可选字段）</td><td>empty 1970-2099</td><td>, - * /</td>
</tr>
</table>
<hr/>
<h4 align="left">例子说明</h4>
<p>第一例：0 0 12 * * ？ 表示每天中午12点触发</p>
<p>第一例：0 0 12 LW * ？ 2005 表示2005年每月的最后一个工作日的12点触发</p>
<br>
<h4 align="left">特殊字符说明</h4>
<p>1)'*'字符可以用于所有字段，在'分'字段中设为'*'表示“每一分钟”的含义</p>
<p>2)'？'字符可以用在“日”和“周几”字段，它用来指定“不明确的值”，比方说你指定了天，但是不确定该天是周几，那么周几字段就可以用'?'代替</p>
<p>3)'-'字符用来指定一个值的范围，在'分'中指定1-12表示1至12分这个区间</p>
<p>4)','字符用于当指定某个字符的时候可以用','分隔，比方：'周几'字段中设为“MON,WED,RFI”分别表示周一，周三和周五</p>
<p>5)'/'字符则表示一个值的在可变化的区间内增加幅度，比方说在'秒'中的值设为5/15，那么则表示在60秒的区间内第5,20,35,50秒的时候触发，该累加不会循环开始，即如果我设为45/30那么只会在45秒的时候触发，因为45加上30为75，已经大于59</p>
<p>6)'L'字符用在'日'和'周几'中，它是'last'的缩写，表示最后一天，但在'周几'和'日'中用法有区别，在'日'中单独用'L'表示月的最后一天，在'周几'中单独使用是表示7或者SAT，但是如果'L'前面跟数字，比方说'6L'则表示该月的最后一个周五</p>
<p>7)'W'字符仅在'日'中使用，表示工作日的意思，前面跟数字，表示距离该天最近的工作日。比方说'16L'表示距离16号最近的工作日，假如16号是周六，那么15号触发，如果是周日，则17号触发，如果16号是周五，那么会当天触发。但是如果是'1L'，1号是周六，那么会在3号触发，因为任务只会在该月触发，不会跨月触发。同时'LW'可以连用，表示该月的最后一个工作日</p>
<p>8)'#'字符用在'周几'字段中，它表示该月第几个周几，比如'6#3',该月第3个周五，倘若指定的日期不存在，则不会触发，如'5#5',该月第5个周四不存在，则不会触发</p>
<p>9)'C'字符可用于'日'和'周几'，它是'calendar'的缩写，如果该值包含的日期存在则按规则来，若没有则包含全部日期。如果在'日'中写的'5C'表示日历中的‘第一天或者5号以后’，'周几'中'1C'表示'日历中的第一天或者周日以后'</p>
   <br><br> </section>
</template>
<style scope="">
.chart-container {
    width: 80%;
    margin:0 auto;
    font-size: 1.2rem;
}
</style>
